<template>
  <div class="w-full">
    <div class="w-5/6 mx-auto flex pt-10 gap-10 flex-col md:flex-row">
      <div class="">
        <h1 class="text-3xl mb-5">Про Леона</h1>
        <p>
          Леон, Леон один из самых первых легендарных персонажей в игре. Он имел
          новую механику в то время. Спустя время ему дали звездные силы: 1,
          дает быстрее двигаться когда он становился невидимым, 2, дает ему
          здоровье когда он невидим. Леону одному из первых дали гипер заряд,
          что подняло его в списке бойцов. Так же у него есть 2 гаджета, 1
          создает лежачий чупачупс на полу, и этот чупачупс делает невидимыми
          своих союзников в определенной зоне.
        </p>
      </div>
      <div class="w-full md:w-3/5">
        <img
          src="https://www.pngitem.com/pimgs/m/533-5338261_brawl-stars-leon-skins-hd-png-download.png"
          alt=""
          class="w-full h-full object-cover rounded-2xl"
        />
      </div>
    </div>
  </div>

  <div class="w-full">
    <div class="w-5/6 mx-auto flex pt-10 gap-10 flex-col-reverse md:flex-row">
      <div class="w-full md:w-3/5">
        <img
          src="https://www.brawlstarsdicas.com.br/wp-content/uploads/2023/12/kit-brawl-stars-skin-padrao.png"
          alt=""
          class="w-full h-full object-cover rounded-2xl"
        />
      </div>

      <div class="">
        <h1 class="text-3xl mb-5">Про Кита</h1>

        <p>
          Кит легендарный боец, который был слишком сильным в начале когда он
          вышел. Кит относительно недавно вышел, но игроки кто играл в это
          время, ненавидели китов в шд. Ведь про помощи 1 звездной силы, кит мог
          использовать свою ульту бесконечно, но только когда соберет 6 банок.
          Ведь ульты у кита, это прыгать на своего противника или союзника, и
          держаться. Противников он стопил и наносил незначительный урон, но
          когда он только прицеплялся то урон был 1920, а когда кит прицеплялся
          на союзника, то он лечил и мог кидать клубки которые взрываются. При
          помощи его звездной силы, кит игрался только в шд, ведь она давали в 2
          раза больше преимуществ от банок, и быстрее копил ульту. 2 звездная
          сила давала на 5 секунд дольше сидеть на своем союзнике.
        </p>
      </div>
    </div>
  </div>

  <div class="w-full">
    <div class="w-5/6 mx-auto flex pt-10 gap-10 flex-col md:flex-row">
      <div class="">
        <h1 class="text-3xl mb-5">Про Тару</h1>
        <p>
          Тара, мой самый любимый боец. Если ты любишь бойца, то это называют
          «мейн боец( от слова main, что переводится как главный)». Она всегда
          была хороша и всегда держалась минимум на 3 звездах. У нее очень
          красивые скины, которые у меня все. К сожалению я не смог апнуть 30
          ранг на ней, но она осталась на 29. У нее 2 звездных силы, 1 она
          создает черта из ее ульты который наносит урон, 2 создает черта
          который лечит ее и ее союзников. 1 гаджет создает 3 слабых чертиков
          которые наносят урон, 2 гаджет дает на 5 секунд просвечивает все
          кусты. Ее Ульма это как черная дыра, она притягивает противников в
          нее, тара играется чаще всего в гем грабе(это режим где надо собирать
          кристаллы), ведь она может держать фланг и перевернуть ход игры
          притянув 3 соперников одной ультой.
        </p>
      </div>
      <div class="w-full md:w-3/5">
        <img
          src="https://www.brawlstarsdicas.com.br/wp-content/uploads/2021/02/tara-brawl-stars-skin-padrao-746x1024.png"
          alt=""
          class="w-full h-full object-cover rounded-2xl"
        />
      </div>
    </div>
  </div>
</template>
<script>
export default {};
</script>
<style scoped></style>
